students13 = [
    ['בוסי שרעבי', 'אוראל', '4'], ['גידניאן', 'מאיה', '5'], ['זכרי', 'ירין', '5'],
    ['לוי', 'מאיה מרים', '4'], ['מבורך לוי', 'גל', '5'], ['מבורך לוי', 'רן', '4'],
    ['מונסונגו', 'עדי נעמי', '5'], ['סיידיאן', 'אמיתי', '4'], ['סיני', 'ליאם', '4'],
    ['סמרה', 'מעיין', '4'], ['עבדן', 'מאור', '5'], ['פרטוק', 'אילאי נאור', '4'],
    ['צדוק', 'שירה אושרת', '5'], ['קוסטנקו', 'מאיה', '4'], ['שבתאי', 'שהם', '5'],
    ['שמחון', 'אימבר', '5'], ['שמסיאן', 'ערן', '4'], ['שפיר', 'טוהר', '4']
]
students14 = [
    ['אברמוב', 'ליאן', '3'], ['אוחיון', 'טליה', '3'], ['אזולאי', 'ליאם', '3'],
    ['אזולאי', 'עדיאל', '5'], ['ארוך', 'ליאן', '3'], ['בן חמו', 'ליאן', '3'],
    ['גדמו', 'חיים', '3'], ['דילאו', 'דוד', '3'], ['דניאלי', 'אוריאל', '3'],
    ['ווסה', 'לי שי יעקב', '5'], ['יונה', 'נהוראי מאיר', '3'], ['ימין', 'לורין', '3'],
    ['כהן', 'אליאן', '3'], ['כהן', 'טליה', '5'], ['מיסטריאל', 'נתנאל', '3'],
    ['ניגרקר', 'איתי', '3'], ['קיוויתי', 'אושר', '3'], ['קיליגין', 'מקסים', '4'],
    ['קנבסקי', 'סוניה', '4'], ['שפעים', 'איתי', '3'], ['שקד', 'אוריה', '3'],
    ['ששון', 'אריאל יוסף', '4']
]
set13 = { (x[0], x[1]) for x in students13 }
set14 = { (x[0], x[1]) for x in students14 }
print('intersection', set13 & set14)

